In [50]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt
from tqdm import tqdm

#loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [ ]:
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [52]:
median_yearly_avg = df['salary_year_avg'].median()

In [53]:
median_hourly_avg = df['salary_hour_avg'].median()

In [60]:
df_filled = df

In [ ]:
df['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_yearly_avg)
df['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_hourly_avg)

In [62]:
df_filled['salary_year_avg']

0         115000.0
1         115000.0
2         115000.0
3         115000.0
4         115000.0
            ...
785736    115000.0
785737    115000.0
785738    115000.0
785739    115000.0
785740    115000.0
Name: salary_year_avg, Length: 785741, dtype: float64

In [64]:
df_filled['salary_hour_avg']

0         45.98
1         45.98
2         45.98
3         45.98
4         45.98
          ...
785736    45.98
785737    45.98
785738    45.98
785739    45.98
785740    45.98
Name: salary_hour_avg, Length: 785741, dtype: float64

In [66]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [81]:
df_unique = df_filled

df_unique = df_filled.drop_duplicates()

print('length of original: ', len(df_filled))
print('length of unique: ', len(df_unique))
print('drop of duplicates: ',len(df_filled) - len(df_unique))

length of original:  785741
length of unique:  785640
drop of duplicates:  101

In [82]:
df_unique = df_filled

df_unique = df_filled.drop_duplicates(subset= ['job_title', 'company_name'])

print('length of original: ', len(df_filled))
print('length of unique: ', len(df_unique))
print('drop of duplicates: ',len(df_filled) - len(df_unique))

length of original:  785741
length of unique:  508042
drop of duplicates:  277699